# Занятие 2: Базовые типы данных и переменные

**Длительность:** 2 пары (4 академических часа)

## Цели занятия
- Изучить основные типы данных в C++
- Понять разницу между различными типами
- Научиться объявлять и инициализировать переменные
- Познакомиться с константами

---

## Пара 1: Типы данных

### Теоретический материал

### Основные типы данных

#### Целочисленные типы
- `int` - целое число (обычно 32 бита)
- `short` - короткое целое (обычно 16 бит)
- `long` - длинное целое (обычно 32 или 64 бита)
- `long long` - очень длинное целое (обычно 64 бита)
- `char` - символ (обычно 8 бит)

#### Типы с плавающей точкой
- `float` - число с плавающей точкой одинарной точности
- `double` - число с плавающей точкой двойной точности
- `long double` - расширенная точность

#### Логический тип
- `bool` - логическое значение (true/false)

### Объявление и инициализация переменных

```cpp
int x;              // Объявление
int y = 10;         // Инициализация
int z{20};          // Uniform initialization (C++11)
auto a = 5;         // Автоматическое определение типа
```

### Константы

```cpp
const int MAX_SIZE = 100;
constexpr int BUFFER_SIZE = 256;  // Константа времени компиляции
```

### Размеры типов
```cpp
#include <iostream>
#include <limits>

std::cout << "Size of int: " << sizeof(int) << " bytes" << std::endl;
std::cout << "Max int value: " << std::numeric_limits<int>::max() << std::endl;
```

---

## Пара 2: Переменные и константы

### Теоретический материал

#### Объявление и инициализация переменных

```cpp
// Различные способы инициализации
int a;              // Неинициализированная переменная (не рекомендуется)
int b = 10;         // Копирующая инициализация
int c(20);          // Прямая инициализация
int d{30};          // Uniform initialization (C++11, рекомендуется)
int e = {40};       // Uniform initialization с =

// Автоматическое определение типа
auto x = 5;         // int
auto y = 3.14;      // double
auto z = 'A';       // char
```

#### Константы

```cpp
// const - константа времени выполнения
const int MAX_SIZE = 100;
const double PI = 3.14159;

// constexpr - константа времени компиляции (C++11)
constexpr int BUFFER_SIZE = 256;
constexpr int SQUARE(int x) { return x * x; }
constexpr int area = SQUARE(10);  // Вычисляется на этапе компиляции
```

#### Модификаторы типов

```cpp
// signed и unsigned
signed int si = -10;      // Может быть отрицательным
unsigned int ui = 10;     // Только положительные значения

// short и long
short s = 100;
long l = 1000000L;
long long ll = 1000000000LL;

// const и volatile
const int read_only = 42;
volatile int sensor_value;  // Может изменяться извне
```

#### Практические примеры

```cpp
#include <iostream>
#include <limits>

int main() {
    // Размеры типов
    std::cout << "Size of int: " << sizeof(int) << " bytes" << std::endl;
    std::cout << "Size of double: " << sizeof(double) << " bytes" << std::endl;

    // Предельные значения
    std::cout << "Max int: " << std::numeric_limits<int>::max() << std::endl;
    std::cout << "Min int: " << std::numeric_limits<int>::min() << std::endl;

    return 0;
}
```

### Домашнее задание
- Изучить размеры различных типов данных на вашей системе
- Написать программу, демонстрирующую переполнение переменных
- Познакомиться с модификаторами `signed` и `unsigned`
- Создать программу для конвертации между различными целочисленными типами

### Дополнительные материалы
- Стандарт C++: типы данных
- Проблемы переполнения и неопределенного поведения
- Выравнивание данных в памяти

