# Занятие 1: Введение в C++

**Длительность:** 2 пары (4 академических часа)

## Цели занятия
- Познакомиться с языком C++ и его историей
- Понять основные отличия C++ от других языков программирования
- Настроить среду разработки
- Написать первую программу на C++

---

## Пара 1: Основы C++

### Теоретический материал

### Что такое C++?
C++ — это компилируемый язык программирования общего назначения, созданный Бьярном Страуструпом как расширение языка C.

### Основные особенности C++
- Объектно-ориентированное программирование
- Шаблоны (templates)
- Управление памятью
- Производительность
- Многопарадигменность

### Первая программа

```cpp
#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
```

### Компиляция и запуск
```bash
g++ -o program main.cpp
./program
```

---

## Пара 2: Первая программа и компиляция

### Практическая работа

#### Установка среды разработки
- Установка компилятора (GCC/Clang)
- Настройка IDE (VS Code, CLion, или другой)
- Проверка установки: `g++ --version`

#### Первая программа
```cpp
#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    std::cout << "Меня зовут [Ваше имя]" << std::endl;
    return 0;
}
```

#### Компиляция и запуск
```bash
# Компиляция
g++ -o hello hello.cpp

# Запуск
./hello

# Компиляция с предупреждениями
g++ -Wall -Wextra -o hello hello.cpp
```

#### Структура программы на C++
- Директивы препроцессора (`#include`)
- Функция `main()` - точка входа
- Пространства имен (`std::`)
- Операторы ввода/вывода (`std::cout`, `std::cin`)

### Домашнее задание
- Настроить среду разработки (компилятор, IDE)
- Написать программу, которая выводит ваше имя и группу
- Изучить базовые типы данных в C++
- Написать программу, которая запрашивает имя пользователя и выводит приветствие

### Дополнительные материалы
- [cppreference.com](https://en.cppreference.com/)
- Документация по компилятору GCC/Clang
- Основы работы с командной строкой

